tutorials/Matyas/caseConstructor/10_baseCase/system/blockMeshDictL
/*--------------------------------*- C++ -*----------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  4.1                                   | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 	1; 
l   0.1;
d2  0.0104999998553;
d   0.01;
z   1e-3;

vertices 
( 
	 ( 0.0  0.0 0.0 )	// 000
	 (  $l  0.0 0.0 )	// 001
	 (  $l   $d 0.0 )	// 002
	 ( 0.0   $d 0.0 )	// 003
	 ( 0.0  0.0  $z )	// 004
	 (  $l  0.0  $z )	// 005
	 (  $l   $d  $z )	// 006
	 ( 0.0   $d  $z )	// 007
     (  $l  $d2 0.0 )   // 008
     ( 0.0  $d2 0.0 )   // 009
     (  $l  $d2  $z )   // 010
     ( 0.0  $d2  $z )   // 011
); 

edges 
( 
); 

blocks 
( 
	hex ( 0  1  2  3  4  5  6  7)	pipeZone ( 200  20  1)	simpleGrading 	( 1.0  1.0  1.0)
	hex ( 3  2  8  9  7  6 10 11) lambdaZone ( 200  1  1)	simpleGrading 	( 1.0  1.0  1.0)
); 

boundary 
( 
	walls
	{
		type wall;
		faces
		(
			// ( 8  9 11 10)
            ( 1  0  4  5)
            // ( 9  3  7 11)
            // ( 8  2  6 10)
		);
	}

    frontAndBack
    {
        type    empty;
        faces
        (
            ( 0  1  2  3)
            ( 4  5  6  7)
            ( 3  2  8  9)
            ( 7  6 10 11)
        );
    }

	inlet
	{
		type patch;
		faces
		(
            ( 0  4  7  3)
		);
	}

	outlet
	{
		type patch;
		faces
		(
            ( 1  2  6  5)
		);
	}

); 

mergePatchPairs 
( 
); 
