tutorials/Matyas/caseConstructor/10_baseCase/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (u0 0 0);

boundaryField
{
    "(inlet|walls)"
    {
        type            fixedValue;
        value           $internalField;
    }
    
    outlet
    {
        // type            pressureInletOutletVelocity;
        // value           uniform (0 0 0);
        type            zeroGradient;
    }
    
    atmosphere
    {
        type            noSlip;
    }

    // wall
    // {
    //     type            noSlip;
    // }
    
    "(wedgeZ0|wedgeZE)"
    {
        type            wedge;
    }
}


// ************************************************************************* //
