tutorials/Matyas/caseConstructor/10_baseCase/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform p0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    
    outlet
    {
        type            totalPressure;
        p0              uniform p0;
        value           uniform p0;
    
        U               U;
        phi             phi;
    }
    
    "(atmosphere|walls)"
    {
        type            zeroGradient;
    }

    "(wedgeZ0|wedgeZE)"
    {
        type            wedge;
    }
}

// ************************************************************************* //
