tutorials/Matyas/caseConstructor/10_baseCase/0.org/TporMedia
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300.0;

boundaryField
{
    "(inlet|walls)"
    {
        type            fixedValue;
        value           $internalField;
    }
    "(outlet|sides)"
    {
        type            zeroGradient;
    }
    
    atmosphere
    {
        type            fixedValue;
        value           uniform 350;
    }
    
    "(wedgeZ0|wedgeZE)"
    {
        type            wedge;
    }
}